-- | Домашка 2. Параметрический полиморфизм: уровень 3.
module Level3 where

import GHC.Exts (RuntimeRep, TYPE)
import MetaUtils (todo)
import GHC.Base (Void)


-- 3.1. Тип error
--
-- Как на самом деле выглядит тип функции error? Дайте error' такую же сигнатуру
-- (без HasCallStack) и реализуйте её через error. В комментарии объясните, почему такая
-- сигнатура не нарушает запрет на связыватели, полиморфные по представлению, и зачем
-- error вообще полиморфна по представлению.

-- Потому что на самом деле никакого значения, которое бы имело произвольное
-- представление в рантайме, тут нет
error' :: forall (k :: RuntimeRep) (t :: TYPE k). String -> t
error' = error
